Revit 2024 API
BuiltInFailures.StairRampFailures.TreadDepthBelowMin Property
 The Actual Tread Depth for one or more Stairs violates the Minimum Depth set in the type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TreadDepthBelowMin { get; }
Visual Basic
Public Shared ReadOnly Property TreadDepthBelowMin As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TreadDepthBelowMin {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace